renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/blebrr.c

/**
 *  \file blebrr.c
 *
 *  This File contains the BLE Bearer interface for the
 *  Mindtree Mesh stack.
 */

/*
 *  Copyright (C) 2016. Mindtree Ltd.
 *  All rights reserved.
 */

/*******************************************************************************
* Includes   <System Includes> , "Project Includes"
*******************************************************************************/
#include "r_mesh_rx23w_if.h"
#include "blebrr.h"
#include "timer/r_ble_timer.h"

/*******************************************************************************
* Macro definitions
*******************************************************************************/
#define BLEBRR_QUEUE_SIZE                   64
#define BLEBRR_ADV_TIMEOUT                  4
#define BLEBRR_NCON_ADVTYPE_OFFSET          2
#define BLEBRR_ADVREPEAT_COUNT              3
#define BLEBRR_ADVREPEAT_RAND_DELAY         10

/** Bearer state defines */
#define BLEBRR_STATE_IDLE                   0x00
#define BLEBRR_STATE_IN_SCAN_ENABLE         0x01
#define BLEBRR_STATE_IN_SCAN_DISABLE        0x02
#define BLEBRR_STATE_SCAN_ENABLED           0x04
#define BLEBRR_STATE_IN_ADV_ENABLE          0x10
#define BLEBRR_STATE_IN_ADV_DISABLE         0x20
#define BLEBRR_STATE_ADV_ENABLED            0x40

#define BLEBRR_STATE_MASK_SCAN              0x0F
#define BLEBRR_STATE_MASK_ADV               0xF0

#define BLEBRR_MASK_STATE_ADV_ACTIVE \
                (BLEBRR_STATE_IN_ADV_ENABLE  | \
                 BLEBRR_STATE_IN_ADV_DISABLE | \
                 BLEBRR_STATE_ADV_ENABLED)

/** Beacon type defines */
#define BLEBRR_UPROV_ADV_BCON               0x00
#define BLEBRR_UPROV_ADV_URI                0x01
#define BLEBRR_UPROV_GATT_BCON              0x02
#define BLEBRR_UPROV_GATT_URI               0x03
#define BLEBRR_SECNET_BCON                  0x04
#define BLEBRR_NUM_BCONS                    0x05

/** GATT Mode GAP Connectable Advertising Service data offset */
#define BLEBRR_GATT_ADV_SERV_DATALEN_OFFSET 7
#define BLEBRR_GATT_ADV_SERV_DATA_OFFSET    (BLEBRR_GATT_ADV_SERV_DATALEN_OFFSET + 4)

/** Advertising data maximum length */
#define BLEBRR_GAP_ADVDATA_LEN              31

/** Advertising data sets MAX */
#define BLEBRR_GAP_MAX_ADVDATA_SETS         2

#define BLEBRR_MUTEX_INIT()                 MS_MUTEX_INIT(blebrr_mutex, BRR);
#define BLEBRR_MUTEX_INIT_VOID()            MS_MUTEX_INIT_VOID(blebrr_mutex, BRR);
#define BLEBRR_LOCK()                       MS_MUTEX_LOCK(blebrr_mutex, BRR);
#define BLEBRR_LOCK_VOID()                  MS_MUTEX_LOCK_VOID(blebrr_mutex, BRR);
#define BLEBRR_UNLOCK()                     MS_MUTEX_UNLOCK(blebrr_mutex, BRR);
#define BLEBRR_UNLOCK_VOID()                MS_MUTEX_UNLOCK_VOID(blebrr_mutex, BRR);

#define BLEBRR_SET_STATE_SCAN(x)            blebrr_state = (x) | (blebrr_state & (~BLEBRR_STATE_MASK_SCAN))
#define BLEBRR_SET_STATE_ADV(x)             blebrr_state = (x) | (blebrr_state & (~BLEBRR_STATE_MASK_ADV))
#define BLEBRR_GET_STATE_SCAN()             (blebrr_state & BLEBRR_STATE_MASK_SCAN)
#define BLEBRR_GET_STATE_ADV()              (blebrr_state & BLEBRR_STATE_MASK_ADV)

/*******************************************************************************
* Type definitions
*******************************************************************************/
/** BLEBRR Data Queue Element */
typedef struct _BLEBRR_Q_ELEMENT
{
    /* "Allocated" Data Pointer */
    UCHAR *pdata;

    /*
     *  Data Length. If data length is zero, the element is considered
     *  invalid.
     */
    UINT16 pdatalen;

    /* Type of data element */
    UCHAR type;

} BLEBRR_Q_ELEMENT;

/** BLEBRR Data Queue */
typedef struct _BLEBRR_Q
{
    /* List of Bearer Queue elements */
    BLEBRR_Q_ELEMENT element[BLEBRR_QUEUE_SIZE];

    /* Queue start index */
    UINT16 start;

    /* Queue end index */
    UINT16 end;

} BLEBRR_Q;

/** Advertising Data type */
typedef struct _BLEBRR_GAP_ADV_DATA
{
    /** Data */
    UCHAR data[BLEBRR_GAP_ADVDATA_LEN];

    /** Data Length */
    UCHAR datalen;

} BLEBRR_GAP_ADV_DATA;


/*******************************************************************************
* Global Variables and Private Functions declaration
*******************************************************************************/
static BRR_BEARER_INFO blebrr_adv;
static BRR_HANDLE blebrr_advhandle;

static UCHAR blebrr_bconidx;
static UCHAR blebrr_beacons;
static BLEBRR_Q_ELEMENT blebrr_bcon[BRR_BCON_COUNT];
static BLEBRR_Q blebrr_queue;
/* static UCHAR blebrr_adv_bcon_type; */

MS_DEFINE_MUTEX_TYPE(static, blebrr_mutex)
static UINT32 blebrr_timer_handle;
static UCHAR blebrr_timer_active;
static UCHAR blebrr_state;
static UCHAR blebrr_datacount = 0;
static UCHAR blebrr_memcount = 0;

/* static UCHAR blebrr_scan_type; */
static UCHAR blebrr_advrepeat_count;

BLEBRR_GAP_ADV_DATA blebrr_gap_adv_data[BLEBRR_GAP_MAX_ADVDATA_SETS] =
{
    /* Index 0x00: Mesh Provisioning Service ADV Data */
    {
        {
            /**
             *  Flags:
             *      0x01: LE Limited Discoverable Mode
             *      0x02: LE General Discoverable Mode
             *      0x04: BR/EDR Not Supported
             *      0x08: Simultaneous LE and BR/EDR to Same Device Capable (Controller)
             *      0x10: Simultaneous LE and BR/EDR to Same Device Capable (Host)
             */
            0x02, 0x01, 0x06,

            /**
             *  Service UUID List:
             *      Mesh Provisioning Service (0x1827)
             */
            0x03, 0x03, 0x27, 0x18,

            /**
             *  Service Data List:
             *      Mesh Provisioning Service (0x1827)
             *      Mesh UUID (16 Bytes)
             *      Mesh OOB Info (2 Bytes)
             *  NOTE: UUID and OOB Info are set by the blebrr_bcon_send().
             */
             0x15, 0x16,
             0x27, 0x18,
             0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
             0x00, 0x00
        },

        /** Advertising Data length */
        29
    },
    /* Index 0x01: Mesh Proxy Service ADV Data */
    {
        {
            /**
             *  Flags:
             *      0x01: LE Limited Discoverable Mode
             *      0x02: LE General Discoverable Mode
             *      0x04: BR/EDR Not Supported
             *      0x08: Simultaneous LE and BR/EDR to Same Device Capable (Controller)
             *      0x10: Simultaneous LE and BR/EDR to Same Device Capable (Host)
             */
            0x02, 0x01, 0x06,

            /**
             *  Service UUID List:
             *      Mesh Proxy Service (0x1828)
             */
            0x03, 0x03, 0x28, 0x18,

            /**
             *  Service Data List:
             *      Mesh Proxy Service (0x1828)
             *      Type (1 Byte) 
             *          0x00: Network ID
             *          0x01: Node Identity
             *      Network ID (8 Bytes), if Type is 0x00
             *      Hash (8 Bytes) and Random (8 Bytes), if Type is 0x01
             *  NOTE: AD Length is calculated and set by the blebrr_bcon_send().
             *  NOTE: Type, Network ID, Hash and Random are set by the blebrr_bcon_send().
             *  NOTE: The BLEBRR_GATT_ADV_SERV_DATALEN_OFFSET macro specifies offset to this Service Data List AD Structure.
             *  NOTE: The BLEBRR_GATT_ADV_SERV_DATA_OFFSET macro specifies offset to the Service Data.
             */
             0x00, 0x16,
             0x28, 0x18,
             0x00,
             0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
        },

        /** Advertising Data length */
        20
    }
};

static UCHAR blebrr_sleep;

