renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/blebrr.c
/*******************************************************************************
* Functions
*******************************************************************************/
/***************************************************************************//**
* @brief Enables Scan
*******************************************************************************/
void blebrr_scan_enable(void)
{
    BLEBRR_LOCK_VOID();

    if ((BLEBRR_STATE_IDLE == BLEBRR_GET_STATE_SCAN()) &&
        (MS_TRUE != blebrr_sleep))
    {
        blebrr_scan_pl(MS_TRUE);

        /* Update state */
        BLEBRR_SET_STATE_SCAN(BLEBRR_STATE_IN_SCAN_ENABLE);
    }

    BLEBRR_UNLOCK_VOID();
}

static UCHAR blebrr_get_beacon_type(UCHAR type, UCHAR bcon)
{
    return (BRR_BCON_PASSIVE == type)?
           ((BRR_BCON_TYPE_UNPROV_DEVICE == bcon)? BLEBRR_UPROV_ADV_BCON: BLEBRR_SECNET_BCON):
           ((BRR_BCON_TYPE_UNPROV_DEVICE == bcon)? BLEBRR_UPROV_GATT_BCON: BLEBRR_NUM_BCONS);
}

static BLEBRR_Q_ELEMENT * blebrr_enqueue_alloc(void)
{
    BLEBRR_Q_ELEMENT * elt;
    UINT16 ei;

    /* Get reference to the requested Queue block members */
    elt = blebrr_queue.element;
    ei = blebrr_queue.end;

    /* Check if queue end element is free */
    if (0 != (elt + ei)->pdatalen)
    {
        /* Not free */
        elt = NULL;
    }
    else
    {
        /* Set the element to be returned */
        elt = (elt + ei);

        /* Update the data availability */
        blebrr_datacount++;

        /* Update queue end */
        ei++;
        ei &= (BLEBRR_QUEUE_SIZE - 1);
        blebrr_queue.end = ei;
    }

    return elt;
}

static BLEBRR_Q_ELEMENT * blebrr_dequeue(void)
{
    BLEBRR_Q_ELEMENT * elt;
    UINT16 si;

    /* Get reference to the requested Queue block members */
    elt = blebrr_queue.element;
    si = blebrr_queue.start;

    /* Check if queue start element is valid */
    if (0 == (elt + si)->pdatalen)
    {
        /* Not valid */
        elt = NULL;
    }
    else
    {
        /* Set the element to be returned */
        elt = (elt + si);

        /* Is Adv data type in element? */
        if (BRR_BCON_COUNT == elt->type)
        {
            /* Update the data availability */
            blebrr_datacount--;
        }

        /* Update queue start */
        si++;
        si &= (BLEBRR_QUEUE_SIZE - 1);
        blebrr_queue.start = si;
    }

    return elt;
}

static void blebrr_clear_bcon(UCHAR bcon)
{
    BLEBRR_Q_ELEMENT * elt;

    /* Get reference to the beacon queue element */
    elt = &blebrr_bcon[bcon];

    /* Clear the element and the next one for the given type of beacon */
    if (NULL != elt->pdata)
    {
        EM_free_mem (elt->pdata);
        blebrr_memcount--;
        elt->pdata = NULL;
        elt->pdatalen = 0;

        elt->type = BRR_BCON_COUNT;

        if ((BRR_BCON_TYPE_UNPROV_DEVICE == bcon) &&
            (NULL != (elt + 1)->pdata) &&
            (0 != (elt + 1)->pdatalen))
        {
            EM_free_mem((elt + 1)->pdata);
            blebrr_memcount--;
            (elt + 1)->pdata = NULL;
            (elt + 1)->pdatalen = 0;

            (elt + 1)->type = BRR_BCON_COUNT;
        }

        blebrr_datacount--;
    }
}

static BLEBRR_Q_ELEMENT * blebrr_get_next_beacon(void)
{
    BLEBRR_Q_ELEMENT * elt;
    UCHAR index;

    elt = NULL;

    if (0 == blebrr_beacons)
    {
        return elt;
    }

    index = blebrr_bconidx;

    do
    {
        if (blebrr_beacons & (UCHAR)(1 << index))
        {
            elt = &blebrr_bcon[index];
        }

        index++;
        if (BRR_BCON_COUNT == index)
        {
            index = 0;
        }
    } while (NULL == elt);

    blebrr_bconidx = index;

    return elt;
}

static API_RESULT blebrr_update_advdata(void)
{
    BLEBRR_Q_ELEMENT * elt;
    UCHAR type;

    elt = NULL;

    /**
     * Prioritize transmission of data over beacons.
     */
    elt = blebrr_dequeue();

    /* No Data, Check if any beacon available */
    if (NULL == elt)
    {
        elt = blebrr_get_next_beacon();
    }

    /* Any beacon or data to be transmitted? */
    if (NULL == elt)
    {
        /* No, return */
        return API_FAILURE;
    }

    /* Set the type */
    type = ((BRR_BCON_COUNT == elt->type) ? BRR_BCON_PASSIVE : elt->type);

    /* Update global adv bcon type */
    /* blebrr_adv_bcon_type = type; */

    /* Set the advertising data */
    blebrr_advrepeat_count = 1;
    blebrr_advertise_data_pl(type, elt->pdata, elt->pdatalen);

    /* Is Adv data type in element? */
    if (BRR_BCON_COUNT == elt->type)
    {
        /* Yes, Free the element */
        EM_free_mem(elt->pdata);
        blebrr_memcount--;
        elt->pdata = NULL;
        elt->pdatalen = 0;
    }

    return API_SUCCESS;
}

static API_RESULT blebrr_send
                       (
                           UCHAR type,
                           void * pdata,
                           UINT16 datalen,
                           BLEBRR_Q_ELEMENT ** pelt
                       )
{
    API_RESULT retval;
    UCHAR * data, * ptr;
    UINT16 packet_len;
    UCHAR offset;
    BLEBRR_Q_ELEMENT * elt;

    data = (UCHAR *)pdata;
    elt = *pelt;

    /* Get the offset based on the type */
    offset = (0 != type)? BLEBRR_NCON_ADVTYPE_OFFSET: 0;

    /* Calculate the total length, including Adv Data Type headers */
    packet_len = datalen + offset;

    /* Allocate and save the data */
    ptr = EM_alloc_mem(packet_len);
    if (NULL == ptr)
    {
        BLEBRR_LOG("Failed to allocate memory!\n");
        return API_FAILURE;
    }
    blebrr_memcount++;

    if (NULL == elt)
    {
        /* Allocate the next free element in the data queue */
        elt = blebrr_enqueue_alloc();

        /* Is any element free? */
        if (NULL == elt)
        {
            /* Unlock */
            BLEBRR_UNLOCK();

            /* Free the memory allocated */
            EM_free_mem (ptr);
            blebrr_memcount--;
            elt->pdata = NULL;

