renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/blebrr.c
            BLEBRR_LOG("Queue Full!\n");
            return API_FAILURE;
        }

        /* Update element type */
        elt->type = BRR_BCON_COUNT;
    }

    /* Assign the allocated memory */
    elt->pdata = ptr;

    if (offset >= 1)
    {
        /* Add the Length and Adv type headers */
        elt->pdata[0] = (UCHAR)(datalen + (offset - 1));

        if (offset - 1)
        {
            elt->pdata[1] = type;
        }
    }

    /* Update the data and datalen */
    memcpy((elt->pdata + offset), data, datalen);
    elt->pdatalen = packet_len;

    /* Is the Adv/Scan timer running? */
    if (MS_TRUE == blebrr_timer_active)
    {
        /* Yes. Do nothing */
    }
    else
    {
        if (BLEBRR_STATE_IDLE == BLEBRR_GET_STATE_ADV())
        {
            /* No, Enable Advertising with Data */
            retval = blebrr_update_advdata();

            if (API_SUCCESS == retval)
            {
                /* Update state */
                BLEBRR_SET_STATE_ADV(BLEBRR_STATE_IN_ADV_ENABLE);
            }
        }
    }

    return API_SUCCESS;
}

static API_RESULT blebrr_bcon_send(BRR_HANDLE * handle, void * pdata, UINT16 datalen)
{
    BRR_BEACON_INFO * info;
    BLEBRR_Q_ELEMENT * elt;
    UCHAR op, action, type, bcon, bcontype;
    API_RESULT retval;

    /* Get the beacon information */
    info = (BRR_BEACON_INFO *)pdata;

    /* Get the Operation and Action */
    op = (info->action & 0x0F);
    action = ((info->action & 0xF0) >> 4);

    /* Get the Broadcast/Observe type and Beacon type */
    type = (info->type & 0x0F);
    bcon = ((info->type & 0xF0) >> 4);

    retval = API_SUCCESS;

    /* Lock */
    BLEBRR_LOCK();

    /* Check the operations */
    switch (op)
    {
        case BRR_OBSERVE:
            /* blebrr_scan_type = type; */
            break;

        case BRR_BROADCAST:
            /* Get the Beacon mapping at the BLEBRR */
            bcontype = blebrr_get_beacon_type (type, bcon);

            if (BRR_ENABLE == action)
            {
                /* Update the connectable beacon packet */
                if ((BRR_BCON_ACTIVE == type) && ((NULL != info->bcon_data)))
                {
                    /* Active Beacon (advdata) Source Index */
                    UCHAR abs_index;

                    abs_index = R_MS_BRR_Get_GattMode();

                    if (BLEBRR_GATT_PROV_MODE == abs_index)
                    {
                        /* Copy the incoming UUID and OOB info to global connectable ADV data for PB GATT */
                        /* TODO have a state to decide about provisioned and unprovisioned state */

                        memcpy
                        (
                            blebrr_gap_adv_data[abs_index].data + BLEBRR_GATT_ADV_SERV_DATA_OFFSET,
                            info->bcon_data + 1,
                            16 + 2
                        );

                        /**
                         * NOTE: It is not need to calculate assign the Service Data Length as
                         * Service Data length is Fixed for Connectable Provisioning ADV.
                         * This data length is : 1 + 2 + 16 + 2 = 0x15 Bytes, already updated
                         * in the global data structure blebrr_gap_adv_data[0].
                         */

                        /* Update the beacon type */
                        bcon = BRR_BCON_TYPE_GATT_UNPROV_DEVICE;
                    }
                    /* Assuming that this Active Beacon is for GATT Proxy*/
                    else
                    {
                        /* Copy the incoming Type and either Network ID or Hash and Random to global connectable ADV data for PB GATT */
                        /* TODO have a state to decide about provisioned and unprovisioned state */

                        abs_index = BLEBRR_GATT_PROXY_MODE;

                        /* Copy the incoming Proxy ADV data */
                        memcpy
                        (
                            blebrr_gap_adv_data[abs_index].data + BLEBRR_GATT_ADV_SERV_DATA_OFFSET,
                            info->bcon_data,
                            info->bcon_datalen
                        );

                        /* Copy the incoming Proxy ADV datalen + the BLEBRR_GATT_ADV_SERV_DATA_OFFSET */
                        blebrr_gap_adv_data[abs_index].datalen = BLEBRR_GATT_ADV_SERV_DATA_OFFSET + info->bcon_datalen;

                        /**
                         * Assign the service data length correctly for Proxy ADVs
                         * Total incoming data + 1 Byte of AD Flags + 2 Bytes of Service UUID
                         */
                        blebrr_gap_adv_data[abs_index].data[BLEBRR_GATT_ADV_SERV_DATALEN_OFFSET] =
                            info->bcon_datalen + 1 + 2;
                    }

                    /* Re-assign updated ADV data to Info Structure */
                    info->bcon_data    = blebrr_gap_adv_data[abs_index].data;
                    info->bcon_datalen = blebrr_gap_adv_data[abs_index].datalen;
                }

                /* Check if beacon element is free */
                if (0 != blebrr_bcon[bcon].pdatalen)
                {
                    /* Unlock */
                    BLEBRR_UNLOCK();

                    BLEBRR_LOG("Beacon Not Free!\n");
                    return API_FAILURE;
                }

                /* Update the active beacon mask */
                blebrr_beacons |= (UCHAR)(1 << bcon);

                elt = &blebrr_bcon[bcon];

                blebrr_datacount++;

                /* Update element type */
                elt->type = type;

                /* Schedule to send */
                retval = blebrr_send
                         (
                             ((BRR_BCON_TYPE_UNPROV_DEVICE == bcon) &&
                              (BRR_BCON_ACTIVE != type))? MESH_AD_TYPE_BCON : 0,
                             info->bcon_data,
                             info->bcon_datalen,
                             &elt
                         );

