renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/blebrr.c
                if (API_SUCCESS == retval)
                {
                    /* Check if URI data is present for Unprovisioned device */
                    if ((BRR_BCON_TYPE_UNPROV_DEVICE == bcon) &&
                        (NULL != info->uri) &&
                        (NULL != info->uri->payload) &&
                        (0 != info->uri->length))
                    {
                        elt = &blebrr_bcon[bcon + 1];

                        /* Update element type */
                        elt->type = bcontype + 1;

                        /* Schedule to send */
                        retval = blebrr_send
                                 (
                                     0,
                                     info->uri->payload,
                                     info->uri->length,
                                     &elt
                                 );
                    }
                }
                else
                {
                    /* Remove the beacon with type from the queue */
                    blebrr_clear_bcon (bcon);

                    /* Update the active beacon mask */
                    blebrr_beacons &= (UCHAR)(~(1 << bcon));
               }
            }
            else
            {
                /* Update beacon type for Unprovisioned GATT */
                if ((BRR_BCON_TYPE_UNPROV_DEVICE == bcon) &&
                    (BRR_BCON_ACTIVE == type))
                {
                    bcon = BRR_BCON_TYPE_GATT_UNPROV_DEVICE;
                }

                /* Remove the beacon with type from the queue */
                blebrr_clear_bcon (bcon);

                /* Update the active beacon mask */
                blebrr_beacons &= (UCHAR)(~(1 << bcon));
            }
            break;

        default:
            break;
    }

    /* Unlock */
    BLEBRR_UNLOCK();

    return retval;
}


static API_RESULT blebrr_adv_send(BRR_HANDLE * handle, UCHAR type, void * pdata, UINT16 datalen)
{
    BLEBRR_Q_ELEMENT * elt;
	API_RESULT       retval;

    /* Validate handle */
    if (*handle != blebrr_advhandle)
    {
        return API_FAILURE;
    }

    if ((NULL == pdata) ||
        (0 == datalen))
    {
        return API_FAILURE;
    }

    /* If beacon type, pass to the handler */
    if (MESH_AD_TYPE_BCON == type)
    {
        BRR_BEACON_INFO * info;

        /* Get reference to the beacon info */
        info = (BRR_BEACON_INFO *)pdata;

        if (BRR_BCON_TYPE_SECURE_NET != (info->type >> 4))
        {
            return blebrr_bcon_send(handle, pdata, datalen);
        }
        else
        {
            /* Update the data and length reference */
            pdata = info->bcon_data;
            datalen = info->bcon_datalen;
        }
    }

    /* Lock */
    BLEBRR_LOCK();

    elt = NULL;

    /* Schedule to send */
    retval = blebrr_send
             (
                 type,
                 pdata,
                 datalen,
                 &elt
             );

    /* Unlock */
    BLEBRR_UNLOCK();

    return retval;
}

static void blebrr_adv_sleep(BRR_HANDLE * handle)
{
    BLEBRR_LOCK_VOID();

    /* Set bearer sleep state */
    blebrr_sleep = MS_TRUE;

    if (BLEBRR_STATE_SCAN_ENABLED == BLEBRR_GET_STATE_SCAN())
    {
        /* Disable Scan */
        blebrr_scan_pl(MS_FALSE);

        /* Update state */
        BLEBRR_SET_STATE_SCAN(BLEBRR_STATE_IN_SCAN_DISABLE);
    }

    /* Enter platform sleep */
    EM_enter_sleep_pl();

    BLEBRR_UNLOCK_VOID();
}

static void blebrr_adv_wakeup(BRR_HANDLE * handle, UINT8 mode)
{
    BLEBRR_LOCK_VOID();

    /* Exit platform sleep */
    EM_exit_sleep_pl();

    if (BRR_RX & mode)
    {
        /* Reset bearer sleep state */
        blebrr_sleep = MS_FALSE;

        if (BLEBRR_STATE_IDLE == BLEBRR_GET_STATE_SCAN())
        {
            /* Enable Scan */
            blebrr_scan_pl(MS_TRUE);

            /* Update state */
            BLEBRR_SET_STATE_SCAN(BLEBRR_STATE_IN_SCAN_ENABLE);
        }
    }

    BLEBRR_UNLOCK_VOID();
}

static void blebrr_advscan_timeout_handler(UINT32 timer_hdl)
{
    MS_IGNORE_UNUSED_PARAM(timer_hdl);

    BLEBRR_LOCK_VOID();

    blebrr_timer_active = MS_FALSE;

    /* Check the state of AdvScan procedure */
    switch (BLEBRR_GET_STATE_ADV())
    {
        case BLEBRR_STATE_ADV_ENABLED:
            /* Disable Adv */
            blebrr_advertise_pl (MS_FALSE);

            /* Update state */
            BLEBRR_SET_STATE_ADV(BLEBRR_STATE_IN_ADV_DISABLE);
            break;

        default:
            /* Should not reach here */
            break;
    }

    BLEBRR_UNLOCK_VOID();
}


static void blebrr_timer_start(UINT32 timeout)
{
    ble_status_t retval;

    retval = R_BLE_TIMER_UpdateTimeout(blebrr_timer_handle, timeout);
    if (BLE_SUCCESS == retval)
    {
        blebrr_timer_active = MS_TRUE;
    }
}

/***************************************************************************//**
* @brief Handles Scan operation
*******************************************************************************/
void blebrr_pl_scan_setup(UCHAR enable)
{
    BLEBRR_LOCK_VOID();

    /* Is scan enabled? */
    if (MS_TRUE == enable)
    {
        /* Yes, Update state */
        BLEBRR_SET_STATE_SCAN(BLEBRR_STATE_SCAN_ENABLED);
    }
    else
    {
        /* Update state */
        BLEBRR_SET_STATE_SCAN(BLEBRR_STATE_IDLE);
    }

    BLEBRR_UNLOCK_VOID();
}

/***************************************************************************//**
* @brief Handles Advertisement operation
*******************************************************************************/
void blebrr_pl_advertise_setup(UCHAR enable)
{
    API_RESULT retval;
    UINT32 delay_ms = 0;

    BLEBRR_LOCK_VOID();

    /* Is advertise enabled? */
    if (MS_TRUE == enable)
    {
        /* Yes, Update state */
        BLEBRR_SET_STATE_ADV(BLEBRR_STATE_ADV_ENABLED);

