renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/blebrr.c
        /* Add Random Transmission Delay */
        cry_rand_generate((UCHAR*)&delay_ms, sizeof(UINT32));
        delay_ms %= BLEBRR_ADVREPEAT_RAND_DELAY;

        /* Start bearer timer for Adv Timeout */
        blebrr_timer_start (BLEBRR_ADV_TIMEOUT + delay_ms);
    }
    else
    {
        if (BLEBRR_ADVREPEAT_COUNT > blebrr_advrepeat_count)
        {
            blebrr_advrepeat_count++;
            blebrr_advertise_pl(MS_TRUE);

            /* Update state */
            BLEBRR_SET_STATE_ADV(BLEBRR_STATE_IN_ADV_ENABLE);
        }
        else
        {
            retval = blebrr_update_advdata();

            if (API_SUCCESS == retval)
            {
                /* Update state */
                BLEBRR_SET_STATE_ADV(BLEBRR_STATE_IN_ADV_ENABLE);
            }
            else
            {
                /* Update state */
                BLEBRR_SET_STATE_ADV(BLEBRR_STATE_IDLE);
            }
        }
    }

    BLEBRR_UNLOCK_VOID();
}

/***************************************************************************//**
* @brief Advertisement End function
*******************************************************************************/
void blebrr_pl_advertise_end(void)
{
    BLEBRR_LOCK_VOID();

    BLEBRR_SET_STATE_ADV(BLEBRR_STATE_IDLE);
    /* blebrr_adv_bcon_type = 0; */

    BLEBRR_UNLOCK_VOID();
}

/***************************************************************************//**
* @brief Handles Advertising Reports
*******************************************************************************/
void blebrr_pl_recv_advpacket(UCHAR type, UCHAR * pdata, UINT16 pdatalen, UCHAR rssi)
{
    MS_BUFFER info;

    /* Handle only if Non-Connectable (Passive) Advertising */
    if (BRR_BCON_PASSIVE != type)
    {
        return;
    }

    /* Pack the RSSI as metadata */
    info.payload = &rssi;
    info.length = sizeof(UCHAR);

    /* Deliver the packet to the bearer */
    if (NULL != blebrr_adv.bearer_recv)
    {
        blebrr_adv.bearer_recv(&blebrr_advhandle, pdata, pdatalen, &info);
    }
    else
    {
        BLEBRR_LOG("BEARER RECV Callback Currently NULL !!\n");
    }
}

/***************************************************************************//**
* @brief Registers ADV Bearer with Mesh Stack and Start Scan
*******************************************************************************/
void R_MS_BRR_Setup(void)
{
    /* Initialize locals */
    BLEBRR_MUTEX_INIT_VOID();

    /* Initialize Timer */
    blebrr_timer_active = MS_FALSE;
    R_BLE_TIMER_Create(&blebrr_timer_handle, BLEBRR_ADV_TIMEOUT, BLE_TIMER_ONE_SHOT, blebrr_advscan_timeout_handler);

    /* Reset the bearer sleep */
    blebrr_sleep = MS_FALSE;

    /* Add the Adv Bearer */
    blebrr_adv.bearer_send = blebrr_adv_send;
    blebrr_adv.bearer_sleep = blebrr_adv_sleep;
    blebrr_adv.bearer_wakeup = blebrr_adv_wakeup;
    MS_brr_add_bearer(BRR_TYPE_ADV, &blebrr_adv, &blebrr_advhandle);

    /* Start Observing */
    BLEBRR_LOG ("Start Observing...\n");
    blebrr_scan_pl (MS_TRUE);

    /* Update state */
    BLEBRR_SET_STATE_SCAN(BLEBRR_STATE_IN_SCAN_ENABLE);
}
